import re

#-----採鉱機-----

採鉱機産出量 = {"採鉱機Mk1":60, "採鉱機Mk2":120, "採鉱機Mk3":240}
採鉱機Mk1産出量,採鉱機Mk2産出量,採鉱機Mk3産出量=採鉱機産出量["採鉱機Mk1"],採鉱機産出量["採鉱機Mk2"],採鉱機産出量["採鉱機Mk3"]
採鉱機=("採鉱機Mk1","採鉱機Mk2","採鉱機Mk3")

純度 = {"impure":0.5,"normal":1,"pure":2}
低純度,中純度,高純度 = 純度["impure"],純度["normal"],純度["pure"]

#-----標準入力検知-----
text = input()
if re.search('採鉱機',text):
    if re.search('mk1|Mk1|mK1|MK1|ｍｋ１|Mk１|1|１',text):
        if '低' in text:
            print("採鉱機Mk1の低純度資源ノードでの産出量は稼働率100%の時",採鉱機Mk1産出量*低純度,"/m")
        if '中' in text:
            print("採鉱機Mk1の中純度資源ノードでの産出量は稼働率100%の時",採鉱機Mk1産出量*中純度,"/m")
        if '高' in text:
            print("採鉱機Mk1の高純度資源ノードでの産出量は稼働率100%の時",採鉱機Mk1産出量*高純度,"/m")
    if re.search('mk2|Mk2|mK2|MK2|ｍｋ２|Mk２|2|２',text):
        if '低' in text:
            print("採鉱機Mk2の低純度資源ノードでの産出量は稼働率100%の時",採鉱機Mk2産出量*低純度,"/m")
        if '中' in text:
            print("採鉱機Mk2の中純度資源ノードでの産出量は稼働率100%の時",採鉱機Mk2産出量*中純度,"/m")
        if '高' in text:
            print("採鉱機Mk2の高純度資源ノードでの産出量は稼働率100%の時",採鉱機Mk2産出量*高純度,"/m")
    if re.search('mk3|Mk3|mK3|MK3|ｍｋ３|Mk３|3|３',text):
        if '低' in text:
            print("採鉱機Mk3の低純度資源ノードでの産出量は稼働率100%の時",採鉱機Mk3産出量*低純度,"/m")
        if '中' in text:
            print("採鉱機Mk3の中純度資源ノードでの産出量は稼働率100%の時",採鉱機Mk3産出量*中純度,"/m")
        if '高' in text:
            print("採鉱機Mk3の高純度資源ノードでの産出量は稼働率100%の時",採鉱機Mk3産出量*高純度,"/m")
else:
    print("!^-^-^-^-^-^-^-^_Error_^-^-^-^-^-^-^-^!\n各要素を正しく入力してください\nヒント:各要素に含まれる文字は、'採鉱機' 'Mk(1,2,3)' '(低,中,高)'純度 です\n")
